app/Controllers/Antrean.php

SELECT COUNT(*) AS `numrows`
FROM `antrean`
WHERE `nama_jaminan` LIKE '%UMUM%' ESCAPE '!'
AND  `tanggal_antrean` LIKE '%2026-05-11%' ESCAPE '!'
SELECT *
FROM `antrean`
WHERE `nama_jaminan` LIKE '%UMUM%' ESCAPE '!'
AND  `tanggal_antrean` LIKE '%2026-05-11%' ESCAPE '!'
ORDER BY `id_antrean` DESC
 LIMIT 8
---
    public function list_antrean()
    {
        if (session()->get('role') == 'Admin' || session()->get('role') == 'Admisi') {
            $nama_jaminan = $this->request->getGet('nama_jaminan');
            $tanggal_antrean = $this->request->getGet('tanggal_antrean');
            $limit = $this->request->getGet('limit');
            $offset = $this->request->getGet('offset');

            if (empty($tanggal_antrean)) {
                return $this->response->setJSON(['antrean' => [], 'total' => 0]);
            }

            $limit = $limit ? intval($limit) : 10;
            $offset = $offset ? intval($offset) : 0;

            $AntreanModel = $this->AntreanModel;
            if ($nama_jaminan) {
                $AntreanModel->like('nama_jaminan', $nama_jaminan);
            }
            if ($tanggal_antrean) {
                $AntreanModel->like('tanggal_antrean', $tanggal_antrean);
            }

            $total = $AntreanModel->countAllResults(false);
            $Pasien = $AntreanModel->orderBy('id_antrean', 'DESC')->findAll($limit, $offset);

SELECT *
FROM `antrean`
WHERE `status` = 'SUDAH DIPANGGIL'
ORDER BY `tanggal_antrean` DESC
 LIMIT 1
---
    public function get_latest()
    {
        $model = new \App\Models\AntreanModel();

        // Mengambil antrean yang baru saja dipanggil berdasarkan timestamp terbaru
        $current = $model->where('status', 'SUDAH DIPANGGIL')
            ->orderBy('tanggal_antrean', 'DESC')
            ->first();